openenergymonitor/Hardware/RFM2Pi/firmware/RF12_Demo_atmega328_OLED/RF12mods.cpp
#ifndef EIMSK
#define EIMSK GIMSK    // ATtiny
#endif

static void blockInterrupts () {
#if PINCHG_IRQ
    #if RFM_IRQ < 8
        bitClear(EIMSK, PCIE2);
    #elif RFM_IRQ < 14
        bitClear(EIMSK, PCIE0);
    #else
        bitClear(EIMSK, PCIE1);
    #endif
#else
    bitClear(EIMSK, INT0);
#endif
}

static void allowInterrupts () {
#if PINCHG_IRQ
    #if RFM_IRQ < 8
        bitSet(EIMSK, PCIE2);
    #elif RFM_IRQ < 14
        bitSet(EIMSK, PCIE0);
    #else
        bitSet(EIMSK, PCIE1);
    #endif
#else
    bitSet(EIMSK, INT0);
#endif
}


void rf12_spiInit () {
    bitSet(SS_PORT, cs_pin);
    bitSet(SS_DDR, cs_pin);
    digitalWrite(SPI_SS, 1);
    pinMode(SPI_SS, OUTPUT);
    pinMode(SPI_MOSI, OUTPUT);
    pinMode(SPI_MISO, INPUT);
    pinMode(SPI_SCK, OUTPUT);
#ifdef SPCR    
    SPCR = _BV(SPE) | _BV(MSTR);
#if F_CPU > 10000000
    // use clk/2 (2x 1/4th) for sending (and clk/8 for recv, see rf12_xfer)
    SPSR |= _BV(SPI2X);
#endif
#else
    // ATtiny
    USICR = bit(USIWM0);
#endif    
    pinMode(RFM_IRQ, INPUT);
    digitalWrite(RFM_IRQ, 1); // pull-up
}


// do a single byte SPI transfer
// only used from inside rf12_xfer and rf12_xferState which prevent race 
// conditions, don't call without disabling interrupts first!
static uint8_t rf12_byte (uint8_t out) {
#ifdef SPDR
    SPDR = out;
    // this loop spins 4 usec with a 2 MHz SPI clock
    while (!(SPSR & _BV(SPIF)))
        ;
    return SPDR;
#else
    // ATtiny
    USIDR = out;
    byte v1 = bit(USIWM0) | bit(USITC);
    byte v2 = bit(USIWM0) | bit(USITC) | bit(USICLK);
#if F_CPU <= 5000000
    // only unroll if resulting clock stays under 2.5 MHz
    USICR = v1; USICR = v2;
    USICR = v1; USICR = v2;
    USICR = v1; USICR = v2;
    USICR = v1; USICR = v2;
    USICR = v1; USICR = v2;
    USICR = v1; USICR = v2;
    USICR = v1; USICR = v2;
    USICR = v1; USICR = v2;
#else
    for (uint8_t i = 0; i < 8; ++i) {
        USICR = v1;
        USICR = v2;
    }
#endif
    return USIDR;
#endif
}

/// @details
/// This call provides direct access to the RFM12B registers. If you're careful
/// to avoid configuring the wireless module in a way which stops the driver
/// from functioning, this can be used to adjust some settings.
/// See the RFM12B wireless module documentation. 
static uint16_t rf12_xfer (uint16_t cmd) {
    blockInterrupts();

    // writing can take place at full speed, even 8 MHz works
    bitClear(SS_PORT, cs_pin);
    uint16_t res  = rf12_byte(cmd >> 8) << 8;
    res |= rf12_byte(cmd);
    bitSet(SS_PORT, cs_pin);

    allowInterrupts();
    return res;
}


/// @details
/// Requests RFM12 state from RF module and reads back a waiting data byte if there is
/// any.
/// One of two commands accessing SPI, so interrupts disabled in here
/// @param *data Pointer to  byte where to write the received data to (if any)
static uint16_t rf12_xferState (uint8_t *data) {
    blockInterrupts();

    // writing can take place at full speed, even 8 MHz works
    bitClear(SS_PORT, cs_pin);
    uint16_t res = rf12_byte(0x00) << 8;
    res |= rf12_byte(0x00);
    
    if (res & RF_FIFO_BIT && rxstate == TXRECV) {
        // slow down to under 2.5 MHz
#if F_CPU > 10000000
        bitSet(SPCR, SPR0);
#endif
        *data = rf12_byte(0x00);
#if F_CPU > 10000000
        bitClear(SPCR, SPR0);
#endif
    }
    
    bitSet(SS_PORT, cs_pin);

    allowInterrupts();
    return res;
}


/// @details
/// This call provides direct access to the RFM12B registers. If you're careful
/// to avoid configuring the wireless module in a way which stops the driver
/// from functioning, this can be used to adjust frequencies, power levels,
/// RSSI threshold, etc. See the RFM12B wireless module documentation.
///
/// OBSOLETE! Use rf12_xfer instead.
///
/// This function does no longer return anything.
/// @param cmd RF12 command, topmost bits determines which register is affected.
uint16_t rf12_control(uint16_t cmd) {
    return rf12_xfer(cmd);
}


/// @details
/// Brings RFM12 in idle-mode.
static void rf12_idle() {
	rfmstate &= ~B11110000; // switch off synthesizer, transmitter, receiver and baseband
	rfmstate |=  B00001000; // make sure crystal is running
	rf12_xfer(rfmstate);
}


/// @details
/// Handles a RFM12 interrupt depending on rxstate and the status reported by the RF
/// module. 
static void rf12_interrupt() {
    uint8_t in;
    state = rf12_xferState(&in);
    
    // data received or byte needed for sending
    if (state & RF_FIFO_BIT) {
	
	    if (rxstate == TXRECV) {  // we are receiving

            if (rxfill == 0 && group != 0)
                rf12_buf[rxfill++] = group;

            rf12_buf[rxfill++] = in;
        	rf12_crc = _crc16_update(rf12_crc, in);

    	    // do drssi binary-tree search
	        if ( drssi < 3 && ((rxfill-2)%drssi_bytes_per_decision)==0 ) {// not yet final value
	        	// top nibble when going up, bottom one when going down
	        	drssi = bitRead(state,8)
	        			? (drssi_dec_tree[drssi] & B1111)
	        			: (drssi_dec_tree[drssi] >> 4);
	            if ( drssi < 3 ) {     // not yet final destination, set new threshold
                	rf12_xfer(RF_RECV_CONTROL | drssi*2+1);
            	}
           	}

			// check if we got all the bytes (or maximum packet length was reached)
			if (fixedLength) {
				if (rxfill >= fixedLength || rxfill >= RF_MAX) {
					rf12_idle();
				}
			} else if (rxfill >= rf12_len + 5 || rxfill >= RF_MAX) {
       	    	rf12_idle();
			}
    	} else {                  // we are sending
	        uint8_t out;

    	    if (rxstate < 0) {
	            uint8_t pos = 3 + rf12_len + rxstate++;
            	out = rf12_buf[pos];
        	    rf12_crc = _crc16_update(rf12_crc, out);
    	    } else
	            switch (rxstate++) {
                	case TXSYN1: out = 0x2D; break;
            	    case TXSYN2: out = group; rxstate = - (2 + rf12_len); break;
        	        case TXCRC1: out = rf12_crc; break;
    	            case TXCRC2: out = rf12_crc >> 8; break;
	                case TXDONE: rf12_idle(); // fall through
                	default:     out = 0xAA;
            	}

