openenergymonitor/Hardware/RFM2Pi/firmware/RF12_Demo_atmega328_OLED/RF12mods.cpp
    rf12_xfer(0x80C7 | (band << 4));// EL (ena TX), EF (ena RX FIFO), 12.0pF 
    rf12_xfer(0xA640);              // 868MHz 
    rf12_setBitrate(0x06);          // approx 49.2 Kbps, i.e. 10000/29/(1+6) Kbps
    rf12_xfer(0x94A2);              // VDI,FAST,134kHz,0dBm,-91dBm 
    rf12_xfer(0xC2AC);              // AL,!ml,DIG,DQD4 
    if (group != 0) {
        rf12_xfer(0xCA83);          // FIFO8,2-SYNC,!ff,DR 
        rf12_xfer(0xCE00 | group);  // SYNC=2DXX; 
    } else {
        rf12_xfer(0xCA8B);          // FIFO8,1-SYNC,!ff,DR 
        rf12_xfer(0xCE2D);          // SYNC=2D; 
    }
    rf12_xfer(0xC483);              // AFC@VDI,NO RSTRIC,!st,!fi,OE,EN 
    rf12_xfer(0x9850);              // !mp,90kHz,MAX OUT 
    rf12_xfer(0xCC77);              // OB1,OB0, LPX,!ddy,DDIT,BW0 
    rf12_xfer(0xE000);              // NOT USE 
    rf12_xfer(0xC800);              // NOT USE 
    rf12_xfer(0xC049);              // 1.66MHz,3.1V 

    rxstate = TXIDLE;
    
    allowInterrupts();
}

/// @details
/// This can be used to send out slow bit-by-bit On Off Keying signals to other
/// devices such as remotely controlled power switches operating in the 433,
/// 868, or 915 MHz bands.
///
/// To use this, you need to first call rf12initialize() with a zero node ID
/// and the proper frequency band. Then call rf12onOff() in the exact timing
/// you need for sending out the signal. Once done, either call rf12onOff(0) to
/// turn the transmitter off, or reinitialize the wireless module completely
/// with a call to rf12initialize().
/// @param value Turn the transmitter on (if true) or off (if false).
/// @note The timing of this function is relatively coarse, because SPI
/// transfers are used to enable / disable the transmitter. This will add some
/// jitter to the signal, probably in the order of 10 µsec.
void rf12_onOff (uint8_t value) {
  	if (value) {
  	    rfmstate |= B01111000; // switch on transmitter and all needed components
  	} else {
        rfmstate &= ~B00100000; // switch off transmitter
  	}
    rf12_xfer(rfmstate);
}

/// @details
/// This calls rf12_initialize() with settings obtained from EEPROM address
/// 0x20 .. 0x3F. These settings can be filled in by the RF12demo sketch in the
/// RFM12B library. If the checksum included in those bytes is not valid, 
/// rf12_initialize() will not be called.
///
/// As side effect, rf12_config() also writes the current configuration to the
/// serial port, ending with a newline.
/// @returns the node ID obtained from EEPROM, or 0 if there was none.
uint8_t rf12_config (uint8_t show) {
    uint16_t crc = ~0;
    for (uint8_t i = 0; i < RF12_EEPROM_SIZE; ++i)
        crc = _crc16_update(crc, eeprom_read_byte(RF12_EEPROM_ADDR + i));
    if (crc != 0)
        return 0;
        
    uint8_t nodeId = 0, group = 0;
    for (uint8_t i = 0; i < RF12_EEPROM_SIZE - 2; ++i) {
        uint8_t b = eeprom_read_byte(RF12_EEPROM_ADDR + i);
        if (i == 0)
            nodeId = b;
        else if (i == 1)
            group = b;
        else if (b == 0)
            break;
        else if (show)
            Serial.print((char) b);
    }
    if (show)
        Serial.println();
    
    rf12_initialize(nodeId, nodeId >> 6, group);
    return nodeId & RF12_HDR_MASK;
}

/// @details
/// This function can put the radio module to sleep and wake it up again.
/// In sleep mode, the radio will draw only one or two microamps of current.
///
/// @param n If RF12SLEEP (0), put the radio to sleep
///          If RF12WAKEUP (-1), wake the radio up so that the next call to 
///          rf12_recvDone() can restore normal reception.
void rf12_sleep (char n) {
    if (n < 0)
        rf12_idle();
    else {
        rfmstate &= ~B11111000; // make sure everything is switched off (except bod, wkup, clk)
        rf12_xfer(rfmstate);
    }
    rxstate = TXIDLE;
}


/// @details
/// Request an interrupt in the specified number of milliseconds. This Registers a wakeup-
/// interrupt in the RFM12 module. Use rf12_wakeup() to check if the wakeup-interrupt
/// fired. This allows very deep sleep states (timer off) while still being able to wakeup
/// because of the external interrupt. The RFM12b wakeup-timer only needs about 1.5µA.
/// Don't expect an accurate timing. It's about 10% off. Only one timer is supported.
/// @param m Number of milliseconds
void rf12_setWatchdog (unsigned long m) {
    // calculate parameters for RFM12 module
    // T_wakeup[ms] = m * 2^r
    char r=0;
    while (m > 255) {
        r  += 1;
        m >>= 1;
    }
    
    // Disable old wakeup-timer if enabled
    if (bitRead(rfmstate,1)) {  
        bitClear(rfmstate,1);
        rf12_xfer(rfmstate);
    }
    
    // enable wakeup call if we have to
    if (m>0) {
        // write time to wakeup-register
        rf12_xfer(RF_WAKEUP_TIMER | (r<<8) | m);
        // enable wakeup
        bitSet(rfmstate,1);
        rf12_xfer(rfmstate);
    }
}


/// @details
/// This checks the status of the RF12 low-battery detector. It wil be 1 when
/// the supply voltage drops below 3.1V, and 0 otherwise. This can be used to
/// detect an impending power failure, but there are no guarantees that the
/// power still remaining will be sufficient to send or receive further packets.
char rf12_lowbat () {
    return (state & RF_LBD_BIT) != 0;
}

/// @details
/// This function returns 1 if there was a wakeup-interrupt from the RFM12 module. Use it
/// together with rf12_setWatchdog() for ultra low-power watchdog.
char rf12_watchdogFired() {
	uint8_t res = rf12_gotwakeup;
	rf12_gotwakeup = 0;
	return res;
}

/// @details
/// Set up the easy transmission mechanism. The argument is the minimal number
/// of seconds between new data packets (from 1 to 255). With 0 as argument,
/// packets will be sent as fast as possible:
///
/// * On the 433 and 915 MHz frequency bands, this is fixed at 100 msec (10
///   packets/second).
/// 
/// * On the 866 MHz band, the frequency depends on the number of bytes sent:
///   for 1-byte packets, it will be up to 7 packets/second, for 66-byte bytes of
///   data it will be around 1 packet/second.
/// 
/// This function should be called after the RF12 driver has been initialized,
/// using either rf12_initialize() or rf12_config().
/// @param secs The minimal number of seconds between new data packets (from 1 
///             to 255). With a 0 argument, packets will be sent as fast as 
///             possible: on the 433 and 915 MHz frequency bands, this is fixed 
///             at 100 msec (10 packets/second). On 866 MHz, the frequency 
///             depends on the number of bytes sent: for 1-byte packets, it will 
///             be up to 7 packets/second, for 66-byte bytes of data it will be 
///             approx. 1 packet/second.
/// @note To be used in combination with rf12_easyPoll() and rf12_easySend().
void rf12_easyInit (uint8_t secs) {
    ezInterval = secs;
}

